---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.RbsNetworkValidityError
source: html/47197dbc-ee01-661f-c5db-74321ebe10da.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.RbsNetworkValidityError Property

The family is connected in a network and can no longer keep the connectivity.

## Syntax (C#)
```csharp
public static FailureDefinitionId RbsNetworkValidityError { get; }
```